Revit 2027 API
StairsPath.StairsPathOffset Property
 The offset of stairs path to center line of stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StairsPathOffset { get; set; }
Public Property StairsPathOffset As Double
	Get
	Set
public:
property double StairsPathOffset {
	double get ();
	void set (double value);
}
member StairsPathOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for stairsPathOffset is not finite -or- When setting this property: The stairsPathOffset is larger than half the width of the stairs.
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace